package com.lifang.agentsm.common;

import lombok.Getter;
import lombok.Setter;

public enum ErrorEnum {
	
	AP_ERROR_100000(100000, "系统异常，请联系管理员"),
	AP_ERROR_100001(100001, "系统异常，请检查数据"),
	AP_ERROR_100002(100002, "上传图片错误，请稍后再试"),
	AP_ERROR_100003(100003, "网络不稳定,图片上传失败"),
	AP_ERROR_100004(100004, "请勿重复提交"),
	AP_ERROR_100005(100005, "网络不稳定,请稍后重试"),
	
	AP_ERROR_1100056(1100056, "无效的子划分"),
	AP_ERROR_1100057(1100057, "小区不存在"),
	AP_ERROR_1100058(1100058, "错误的楼号或室号"),
	AP_ERROR_1100060(1100060, "请输入正确楼号信息"),
	AP_ERROR_1100061(1100061, "该房源已经发布出售"),
	
	AP_ERROR_1100026(1100026, "验证码错误"),
	AP_ERROR_1100027(1100027, "该帐号正在审核中"),
	AP_ERROR_1100028(1100028, "该帐号已被禁用"),
	AP_ERROR_1100030(1100030, "请输入价格"),
	AP_ERROR_1100031(1100031, "请正确输入联系电话"),
	AP_ERROR_1100032(1100032, "请输入业主姓名"),
	AP_ERROR_1100011(1100011, "业主姓名格式错误"),
	AP_ERROR_1100042(1100042, "联系人姓名至少包含两个字符"),
	AP_ERROR_1100033(1100033, "请输入联系电话"),
	AP_ERROR_1100034(1100033, "业主姓名不能输入非法字符"),

	AP_ERROR_100026(100026, "请不要输入非法字符"),
	AP_ERROR_1000034(1000034, "手机号码格式不正确"),
	AP_ERROR_1100081(1100081, "请输入合法的价格"),
	AP_ERROR_1100036(1100036, "请输入面积"),
	AP_ERROR_1100037(1100037, "请输入户型"),
	AP_ERROR_1100080(1100080, "请输入合法的面积"),
	AP_ERROR_1000033(1000033, "必选项不能为空"),
	AP_ERROR_1100054(1100054, "相同房东号码不能在同一天内提交2次以上"),
	AP_ERROR_1100055(1100055, "不允许使用中介号码作为房东"),
	AP_ERROR_1100063(1100063, "同一房东手机号在售房源最多2套"),
	AP_ERROR_1100064(1100064, "该楼不存在"),
	AP_ERROR_1100065(1100065, "小区id不能为空"),
	AP_ERROR_1100066(1100066, "租金：不能大于1000万"),
	AP_ERROR_110001(110001, "areaId不能为空"),
	AP_ERROR_110002(110002, "estateId不能为空"),

	AP_ERROR_1100067(1100067, "该小区暂不支持出售"),
	AP_ERROR_1100071(1100071, "该小区暂不支持出租"),
	AP_ERROR_1100069(1100069,"该房源不存在"),
	
	/******************************rent start*************************************/
	AP_ERROR_120001(120001,"该房源已发布出租"),
	AP_ERROR_120002(120002,"该房源已发布出售"),
	AP_ERROR_1100068(1100068,"同一号码最多只能发布3套出租房源"),
	AP_ERROR_1100062(1100062,"该房源已审核失败"),
	AP_ERROR_1100059(1100059,"同一房东号码不允许发布多套出租房源"),
	AP_ERROR_1100070(1100070,"室号格式错误"),
	/******************************rent end*************************************/
	
	AP_ERROR_1100099(1100099, "验证码过期"),
	AP_ERROR_1100100(1100100, "价格输入过大不能超过一亿"),
	
	/******************************user start*************************************/
	
	AP_ERROR_1100101(1100101, "用户ID不能为空"),
	AP_ERROR_1100102(1100102, "用户不存在"),
	AP_ERROR_1100103(1100103, "邀请码不存在"),
	AP_ERROR_1100104(1100104, "头像图片不能为空"),
	AP_ERROR_1100105(1100105, "名片图片不能为空"),
	AP_ERROR_1100106(1100106, "身份证图片不能为空"),
	AP_ERROR_1100107(1100107, "手机号不能为空"),
	AP_ERROR_1100108(1100108, "姓名不能为空"),
	AP_ERROR_1100109(1100109, "身份证号格式不符"),
	AP_ERROR_1100110(1100110, "用户已被冻结,不能登陆"),
	AP_ERROR_1100111(1100111, "身份证号已注册过"),
	/******************************user end*************************************/
	
	
	
	
	/***************************point Pay start****************************************************/ 
	AP_ERROR_1300000(1300000, "提现金额不低于10"),
	AP_ERROR_1300001(1300001, "该用户今天已经提现过一次"),
	AP_ERROR_1300002(1300002, "提现金额大于积分的最大值"),
	AP_ERROR_1300003(1300003, "该房源已经收藏"),
	AP_ERROR_1300004(1300004, "用户信息或者银行卡有误"),
	AP_ERROR_1300005(1300005, "用户绑定的银行卡有处理中的提现"),
	AP_ERROR_1300006(1300006, "您今日已举报多次明天再来吧"),
	AP_ERROR_1300007(1300007, "你还没拨通电话请拨打后再来举报吧！"),
	
	
	
	   
    /***************************point Pay end****************************************************/ 
	AP_ERROR_1100075(1100075,"用户积分不足"),
	AP_ERROR_1100076(1100076,"用户积分不足"), //积分不足并已收藏
	
	AP_ERROR_1100077(1100077,"该房源已失效"),
	
	AP_ERROR_1100078(1100078,"当前用户电话号码为空"),
	AP_ERROR_1100079(1100079,"该房源房东手机号码为空"),
	
	AP_ERROR_1101101(1101101,"调用打电话接口失败"),
	AP_ERROR_1101102(1101102,"房东名称不能为空"),
	
	NULL(-1, ""),
	;
	
	
	
	
	
	@Setter @Getter
	private int status;
	
	@Setter @Getter
	private String message;

	private ErrorEnum(int status, String message) {
		this.status = status;
		this.message = message;
	}
	
}